tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mac-cleanup/mac-cleanup-py"
tap "yt-dlp/taps"

brew "awk"
brew "cloc"
brew "curl"
brew "exa"
brew "eza"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "git"
brew "hledger"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "make"
brew "mkcert"
brew "nano"
brew "ncdu"
brew "neofetch"
brew "nmap"
brew "pandoc"
brew "pnpm"
brew "python"
brew "rename"
brew "ripgrep"
brew "ripgrep-all"
brew "starship"
brew "trash"
brew "wget"
brew "yt-dlp"
brew "mac-cleanup/mac-cleanup-py/mac-cleanup-py"

cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "audacity"
cask "bartender"
cask "calibre"
cask "cyberduck"
cask "discord"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "flux"
cask "google-chrome"
cask "imageoptim"
cask "itsycal"
cask "monitorcontrol"
cask "numi"
cask "obsidian"
cask "orbstack"
cask "qlmarkdown"
cask "rapidapi"
cask "shottr"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "wezterm"
cask "xld"

cask "font-fira-code"

vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "jdinhlife.gruvbox"
vscode "mattn.lisp"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.sublime-keybindings"
vscode "rapidapi.vscode-rapidapi-client"
vscode "stylelint.vscode-stylelint"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
